# ADNAN SHAIKH DST 10224 IMDB ANALYSIS

In [4]:
import numpy as np
import pandas as pd
import sqlite3

In [5]:
db = 'movies.sqlite'
conn = sqlite3.connect(db)
cur = conn.cursor()

NOTE: Kept Q1 and Q2 as it is, as we were asked to complete the notebook.

# QUESTIONS
## Question 1: Can you get all data about movies?

In [63]:
cur.execute('SELECT * FROM movies')
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'budget', 'popularity', 'release_date', 'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline', 'uid', 'director_id'])

print('Shape of Movies data :',movies.shape)
movies.head(10)

Shape of Movies data : (4773, 13)

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43597,Avatar,237000000,150,2009-12-10,2787965087,Avatar,7.2,11800,"In the 22nd century, a paraplegic Marine is di...",Enter the World of Pandora.,19995,4762
1,43598,Pirates of the Caribbean: At World's End,300000000,139,2007-05-19,961000000,Pirates of the Caribbean: At World's End,6.9,4500,"Captain Barbossa, long believed to be dead, ha...","At the end of the world, the adventure begins.",285,4763
2,43599,Spectre,245000000,107,2015-10-26,880674609,Spectre,6.3,4466,A cryptic message from Bond’s past sends him o...,A Plan No One Escapes,206647,4764
3,43600,The Dark Knight Rises,250000000,112,2012-07-16,1084939099,The Dark Knight Rises,7.6,9106,Following the death of District Attorney Harve...,The Legend Ends,49026,4765
4,43601,John Carter,260000000,43,2012-03-07,284139100,John Carter,6.1,2124,"John Carter is a war-weary, former military ca...","Lost in our world, found in another.",49529,4766
5,43602,Spider-Man 3,258000000,115,2007-05-01,890871626,Spider-Man 3,5.9,3576,The seemingly invincible Spider-Man goes up ag...,The battle within.,559,4767
6,43603,Tangled,260000000,48,2010-11-24,591794936,Tangled,7.4,3330,When the kingdom's most wanted-and most charmi...,They're taking adventure to new lengths.,38757,4768
7,43604,Avengers: Age of Ultron,280000000,134,2015-04-22,1405403694,Avengers: Age of Ultron,7.3,6767,When Tony Stark tries to jumpstart a dormant p...,A New Age Has Come.,99861,4769
8,43605,Harry Potter and the Half-Blood Prince,250000000,98,2009-07-07,933959197,Harry Potter and the Half-Blood Prince,7.4,5293,"As Harry begins his sixth year at Hogwarts, he...",Dark Secrets Revealed,767,4770
9,43606,Batman v Superman: Dawn of Justice,250000000,155,2016-03-23,873260194,Batman v Superman: Dawn of Justice,5.7,7004,Fearing the actions of a god-like Super Hero l...,Justice or revenge,209112,4771

In [7]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4773 entries, 0 to 4772
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              4773 non-null   int64
 1   original_title  4773 non-null   object
 2   budget          4773 non-null   int64
 3   popularity      4773 non-null   int64
 4   release_date    4773 non-null   object
 5   revenue         4773 non-null   int64
 6   title           4773 non-null   object
 7   vote_average    4773 non-null   float64
 8   vote_count      4773 non-null   int64
 9   overview        4770 non-null   object
 10  tagline         3951 non-null   object
 11  uid             4773 non-null   int64
 12  director_id     4773 non-null   int64
dtypes: float64(1), int64(7), object(5)
memory usage: 484.9+ KB

## Question 2: How do you get all data about directors?

In [62]:
cur.execute('SELECT * FROM directors')
directors = cur.fetchall()
directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])

print('Shape of Directors data :',directors.shape)
directors.head(100)

Shape of Directors data : (2349, 5)

                 name    id  gender     uid department
0       James Cameron  4762       2    2710  Directing
1      Gore Verbinski  4763       2    1704  Directing
2          Sam Mendes  4764       2      39  Directing
3   Christopher Nolan  4765       2     525  Directing
4      Andrew Stanton  4766       2       7  Directing
..                ...   ...     ...     ...        ...
95         Joe Wright  4857       2   36588  Directing
96        Rob Minkoff  4858       2   18898  Directing
97       Lee Tamahori  4859       2    7256  Directing
98          Paul Feig  4860       2  116805  Directing
99       Peter Ramsey  4861       2  151007  Directing

[100 rows x 5 columns]

In [9]:
directors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2349 entries, 0 to 2348
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        2349 non-null   object
 1   id          2349 non-null   int64
 2   gender      2349 non-null   int64
 3   uid         2349 non-null   int64
 4   department  2349 non-null   object
dtypes: int64(3), object(2)
memory usage: 91.9+ KB

## Question 3: Check how many movies are present in iMDB.

In [96]:
cur.execute('SELECT COUNT(*) FROM movies')
movies = cur.fetchall()
print('Number of Movies in the dataset :', movies[0][0])

Number of Movies in the dataset : 4773

Note/ Analysis : Used COUNT function to count the total number of entires in the table. A dataframe was not required. Used movies[0][0] as the COUNT query returns a list of tuples.

## Question 4: Find these 3 directors: James Cameron ; Luc Besson ; John Woo

In [59]:
cur.execute ("SELECT * FROM directors WHERE name = 'James Cameron' OR name = 'Luc Besson' OR name = 'John Woo'")
dircts = cur.fetchall()
dircts = pd.DataFrame(dircts, columns = ['name', 'id', 'gender', 'uid', 'department'])
print('The information of the required Directors is as follows: ')
dircts.head(5)

The information of the required Directors is as follows:

            name    id  gender    uid department
0  James Cameron  4762       2   2710  Directing
1       John Woo  4893       2  11401  Directing
2     Luc Besson  4949       2     59  Directing

Note / Analysis: Selected all the rows where the director name was the given director names in the question using OR operator. Then used a dataframe to display the fetched results in a table format.

## Question 5: Find all directors with name starting with Steven.

In [60]:
cur.execute ("SELECT id, name FROM directors WHERE name LIKE 'Steven%'")
stvn = cur.fetchall()
stvn = pd.DataFrame(stvn, columns = ['id', 'name'])
print('All directors whose names start with Steven along with their IDs: ')
stvn.head(len(stvn))

All directors whose names start with Steven along with their IDs:

     id                name
0  4799    Steven Spielberg
1  4909   Steven Soderbergh
2  5013        Steven Brill
3  5117     Steven Zaillian
4  5216        Steven Quale
5  5221       Steven Seagal
6  5390  Steven E. de Souza
7  5803    Steven Shainberg
8  6713    Steven R. Monroe

Note / Analysis: Used the LIKE operator to fetch all names and IDs of directors whose names start with STEVEN. % as anything after STEVEN is allowed. Then created a dataframe and displayed it. Used the len(stvn) function to find the count of all STEVENs to display all of them at once using head function.

## Question 6: Count female directors.

In [98]:
cur.execute("SELECT COUNT(*) FROM directors WHERE gender = 1")
wmn = cur.fetchall()
print(f"There are a total of {wmn[0][0]} female directors.")

There are a total of 150 female directors.

Note / Analysis: Used COUNT to count the female directors using WHERE. From the table it was evident that the female directors where assigned the gender id 1.

## Question 7: Find the name of the 10th first women directors?

In [120]:
cur.execute('''
    SELECT name 
    FROM directors 
    WHERE gender = '1'
    LIMIT -1 OFFSET 9
''')

wmn10 = cur.fetchall()
wmn10 = pd.DataFrame(wmn10, columns = ['name'])

print('The name of the 10th female director in our table is: ')
wmn10.head(1)

The name of the 10th female director in our table is:

             name
0  Angelina Jolie

Note / Analysis: Used LIMIT-1 to fetch all remaining rows after the offset. Created the appropriate dataframe and disaplyed only one entry. This entry is the 10th female director in our table.

## Question 8: What are the 3 most popular movies?

In [58]:
cur.execute('SELECT id, original_title, popularity FROM movies ORDER BY popularity DESC')
pplr = cur.fetchmany(3)
pplr = pd.DataFrame(pplr, columns = ['id', 'moviename', 'popularity'])
print('The top 3 most popular movies are: ')
pplr.head(3)

The top 3 most popular movies are:

      id     moviename  popularity
0  44143       Minions         875
1  43692  Interstellar         724
2  44385      Deadpool         514

Note / Analysis: Ordered the movies table in descending order on the popularity column then fetched only the ID, Name and Popularity of the movies. Created the respective dataframe and displayed only 3 movies as required.

## Question 9: What are the 3 most bankable movies?

In [57]:
cur.execute('SELECT id, original_title, budget, revenue, revenue - budget AS profit FROM movies ORDER BY profit DESC')
bank = cur.fetchmany(3)
bank = pd.DataFrame(bank, columns = ['id', 'moviename', 'budget', 'revenue', 'profit'])
print('The top 3 most bankable/profitable movies are: ')
bank.head(3)

The top 3 most bankable/profitable movies are:

      id       moviename     budget     revenue      profit
0  43597          Avatar  237000000  2787965087  2550965087
1  43622         Titanic  200000000  1845034188  1645034188
2  43625  Jurassic World  150000000  1513528810  1363528810

Note / Analysis: Fetched the ID, movie name, budget, revenue as well as a new column called profit which is the difference between revenue and budget. Then sorted according to profit in descending order. Created the respective dataframe and displayed the required 3 movies along with the appropriate details.

## Question 10: What is the most awarded average vote since the January 1st, 2000?

In [56]:
cur.execute('SELECT id, original_title, release_date, vote_average FROM movies WHERE release_date > "2000-01-01" ORDER BY vote_average DESC')
vote = cur.fetchone()
vote = pd.DataFrame([vote], columns = ['id', 'name', 'release_date', 'avg_votes'])
print(f"The highest awarded average vote since 1st of January, 2000 is {vote.at[0, 'avg_votes']}")
print('And the details of the movie with this vote average is: ')
vote.head(1)

The highest awarded average vote since 1st of January, 2000 is 9.5
And the details of the movie with this vote average is:

      id       name release_date  avg_votes
0  47589  Sardaarji   2015-06-26        9.5

Note / Analysis: Fetched the required details with the condition of release_date to consider only Movies released after 1st Jan, 2000 and then ordered the movies according to the average vote awarded. Created the appropriate dataframe and used the "at" function to access the average vote awarded value and printed it along with the details of the movie awarded.

## Question 11: Which movie(s) were directed by Brenda Chapman?

In [31]:
cur.execute('''
    SELECT m.id, m.original_title FROM movies m 
    JOIN directors d 
    ON m.director_id = d.id 
    WHERE m.director_id = (SELECT id FROM directors WHERE name = "Brenda Chapman")
''')
brenda = cur.fetchall()
brenda = pd.DataFrame(brenda, columns = ['movieid', 'moviename'])
print('All movies directed by Brenda Chapman are: ')
brenda.head(100)

All movies directed by Brenda Chapman are:

   movieid moviename
0    43652     Brave

Note / Analaysis: Used JOIN to join the two tables on director id which is common to both. Then fetched only those rows which consisted of the director id of Brenda Chapman using a subquery. Created the appropriate dataframe and displayed the movie names along with their IDs.

## Question 12: Which director made the most movies?

In [55]:
cur.execute('''
SELECT d.*, m.movies_made FROM directors d
JOIN(
    SELECT director_id, COUNT(director_id) AS movies_made 
    FROM movies GROUP BY director_id
    ORDER BY movies_made DESC
    LIMIT 1
) m ON d.id = m.director_id
''')
most = cur.fetchone()
most = pd.DataFrame([most], columns = ['name', 'id', 'gender', 'uid', 'department', 'moviesmade'])

print('Information of the director that made the most movies are: ')
most.head(1)

Information of the director that made the most movies are:

               name    id  gender  uid department  moviesmade
0  Steven Spielberg  4799       2  488  Directing          27

Note / Analysis: First I created two aliases. d for the directors table and m for the table view generated by the subquery in JOIN. In JOIN, the subquery is used to fetch the director_id of the director that made the most movies. Used GROUP BY to find the count of movies made by each director then sorted it according to this count in descending order. Used LIMIT 1 to only fetch the director that made the most movies. Joined the table generated by this subquery with the directors table on directors_id and id from subquery and directors table respectively. Created the appropriate dataframe and displayed using head function.

## Question 13: Which director is the most bankable?

In [54]:
cur.execute('''

SELECT d.*, m.profit FROM directors d
JOIN (
    SELECT director_id, SUM(revenue - budget) AS profit 
    FROM movies GROUP BY director_id
    ORDER BY profit DESC
    LIMIT 1
) m ON d.id = m.director_id
''')

dirctbnk = cur.fetchall()
dirctbnk = pd.DataFrame(dirctbnk, columns = ['name', 'id', 'gender', 'uid', 'department', 'profitmade'])

print('Information of the most bankable/profitable director is: ')
dirctbnk.head(1)

Information of the most bankable/profitable director is:

               name    id  gender  uid department  profitmade
0  Steven Spielberg  4799       2  488  Directing  7479893164

Note / Analysis: Made 2 alaiases, d for the directors table and m for the table view generated by the subquery in JOIN. I used the query from Q.9 and GROUPED it by directors_id to find the total profit made by each director across ALL of their movies. Also, I had to use SUM so that it adds up the profit accross all their movies instead of just showing the profit made on 1 movie. Used LIMIT 1 as we only want the most profitable director. Then joined the subquery table view with the directors table on directors_id and id respectively to retrieve the entire information of the most profitable director. Created the appropriate dataframe and displayed it using head function.

# Budget Analysis

## List out Top 10 highest budget made movies

In [68]:
cur.execute('''

SELECT id, original_title, budget FROM movies
ORDER BY budget DESC

''')

bget = cur.fetchmany(10)
bget = pd.DataFrame(bget, columns=['id', 'original_title', 'budget'])

print('Top 10 Movies with the highest budget are: ')
bget.head(10)

Top 10 Movies with the highest budget are:

      id                               original_title     budget
0  43614  Pirates of the Caribbean: On Stranger Tides  380000000
1  43598     Pirates of the Caribbean: At World's End  300000000
2  43604                      Avengers: Age of Ultron  280000000
3  43607                             Superman Returns  270000000
4  43601                                  John Carter  260000000
5  43603                                      Tangled  260000000
6  43602                                 Spider-Man 3  258000000
7  43610                              The Lone Ranger  255000000
8  43600                        The Dark Knight Rises  250000000
9  43605       Harry Potter and the Half-Blood Prince  250000000

Note / Analysis: Used ORDER BY to order the table according to the budget in descending order. Then used fetchmany(10) to only fetch the first 10 rows as required. Created the appropriate dataframe and displayed using head function.

# Popularity Analysis

## List out Top 10 popularity on movies

In [69]:
cur.execute('''

SELECT id, original_title, popularity FROM movies
ORDER BY popularity DESC

''')

pplrmv = cur.fetchmany(10)
pplrmv = pd.DataFrame(pplrmv, columns=['id', 'original_title', 'popularity'])

print('Top 10 Movies with the highest popularity are: ')
pplrmv.head(10)

Top 10 Movies with the highest popularity are:

      id                                     original_title  popularity
0  44143                                            Minions         875
1  43692                                       Interstellar         724
2  44385                                           Deadpool         514
3  43691                            Guardians of the Galaxy         481
4  43724                                 Mad Max: Fury Road         434
5  43625                                     Jurassic World         418
6  43796  Pirates of the Caribbean: The Curse of the Bla...         271
7  43679                     Dawn of the Planet of the Apes         243
8  43797              The Hunger Games: Mockingjay - Part 1         206
9  43685                                         Big Hero 6         203

Note / Analysis: Similiar to the Budget Analysis, just that instead of budget we are using popularity as the comparision factor.

# Revenue Analysis

## What are the top 10 Revenue movies

In [71]:
cur.execute('''

SELECT id, original_title, revenue FROM movies
ORDER BY revenue DESC

''')

rvn = cur.fetchmany(10)
rvn = pd.DataFrame(rvn, columns=['id', 'original_title', 'revenue'])

print('Top 10 Movies with the highest revenue are: ')
rvn.head(10)

Top 10 Movies with the highest revenue are:

      id              original_title     revenue
0  43597                      Avatar  2787965087
1  43622                     Titanic  1845034188
2  43613                The Avengers  1519557910
3  43625              Jurassic World  1513528810
4  43641                   Furious 7  1506249360
5  43604     Avengers: Age of Ultron  1405403694
6  43721                      Frozen  1274219009
7  43628                  Iron Man 3  1215439994
8  44143                     Minions  1156730962
9  43623  Captain America: Civil War  1153304495

Note / Analysis: Similiar the previous question. Instead we have revenue as the comparison factor.

# Voting Analysis

## Display most popular movies with vote_average

In [74]:
cur.execute('''

SELECT id, original_title, vote_average, popularity FROM movies
ORDER BY vote_average DESC, popularity DESC 

''')

avgpv = cur.fetchmany(10)
avgpv = pd.DataFrame(avgpv, columns=['id', 'original_title', 'vote_average', 'popularity'])

print('Top 10 movies with the highest vote average along with their popularity are: ')
avgpv.head(10)

Top 10 movies with the highest popularity along with their average vote information are:

      id            original_title  vote_average  popularity
0  47116          Stiff Upper Lips          10.0           0
1  47642     Dancer, Texas Pop. 81          10.0           0
2  47589                 Sardaarji           9.5           0
3  45983            One Man's Hero           9.3           0
4  45478  The Shawshank Redemption           8.5         136
5  46567        There Goes My Baby           8.5           0
6  46934             The Godfather           8.4         143
7  46393     The Prisoner of Zenda           8.4           4
8  47462                  Whiplash           8.3         192
9  44259                Fight Club           8.3         146

Note / Analysis: Odered by vote_average first then ordered by popularity so that the movies having the same vote_average are sorted on the basis of their popularity.

## List out Particular movie for Voting average and votecount

In [89]:
cur.execute('''

SELECT id, original_title, vote_average, vote_count FROM movies
ORDER BY vote_average DESC, vote_count DESC

''')

mvvts = cur.fetchall()
mvvts = pd.DataFrame (mvvts, columns = ['movieid', 'original_title', 'vote_average', 'vote_count'])
mvvts.head(100)

    movieid            original_title  vote_average  vote_count
0     47116          Stiff Upper Lips          10.0           1
1     47642     Dancer, Texas Pop. 81          10.0           1
2     47589                 Sardaarji           9.5           2
3     45983            One Man's Hero           9.3           2
4     45478  The Shawshank Redemption           8.5        8205
..      ...                       ...           ...         ...
95    46113           American Beauty           7.9        3313
96    44648                 Prisoners           7.9        3085
97    46563     2001: A Space Odyssey           7.9        2998
98    47168        Dallas Buyers Club           7.9        2886
99    46572         Good Will Hunting           7.9        2811

[100 rows x 4 columns]

Note / Analysis: Selected the required columns then ordered it by vote_average then the vote_count in descending order. Hence, the movies with same vote_average are sorted on the basis of their vote_count.

# Directors Analysis

## List out the director names with number of movies and revenue

In [80]:
cur.execute('''

SELECT d.id, d.name, m.movies_made, m.total_revenue FROM directors d
JOIN (

    SELECT director_id, COUNT(director_id) AS movies_made, SUM(revenue) AS total_revenue
    FROM movies GROUP BY director_id

) m on d.id = m.director_id

''')

dirs = cur.fetchall()
dirs = pd.DataFrame(dirs, columns = ['id', 'name', 'movies_made', 'total_revenue', ])
dirs.head(10)

     id               name  movies_made  total_revenue
0  4762      James Cameron            7     5883569439
1  4763     Gore Verbinski            7     3177013357
2  4764         Sam Mendes            7     2713548809
3  4765  Christopher Nolan            8     4227483234
4  4766     Andrew Stanton            4     2109045355
5  4767          Sam Raimi           11     3132901462
6  4768       Byron Howard            1      591794936
7  4769        Joss Whedon            3     2963831068
8  4770        David Yates            3     2228914996
9  4771        Zack Snyder            7     2476197387

Note / Analysis: Created 2 aliases, d for directors table and m for the table view generated from the subquery in JOIN. In JOIN, I retrieved the directorid, count of the movies made by that director using COUNT, and total revenue of the directors by SUM and then using GROUP BY I categorised the total revenue and movies made according to the director id. Using this id I joined the table with directors. Created the appropriate DataFrame to display the information appropriately.